---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesTrap
source: html/c29e234c-f7a0-1ed6-83b4-d37e07e53025.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesTrap Property

"Trap"

## Syntax (C#)
```csharp
public static ForgeTypeId PlumbingFixturesTrap { get; }
```